In [1]:
#Vesão do python
from platform import python_version
print('Versão da Linguagem Python Usada Neste Jupyter Notebook: ', python_version())

Versão da Linguagem Python Usada Neste Jupyter Notebook:  3.10.4

In [2]:
# Para atualizar um pacote, execute o comando abaixo no terminal ou prompt de comando:
# pip install -U nome_pacote

# Para instalar a versão exata de um pacote, execute o comando abaixo no terminal ou prompt de comando:
#!pip install nome_pacote==versão_desejada

# Depois de instalar ou atualizar o pacote, reinicie o jupyter notebook.

# Instala o pacote watermark.
# Esse pacote é usado para gravar as versões de outros pacotes usados neste jupyter notebook.
#!pip install -q -U watermark

In [3]:
# Importando o módulo Pandas
import pandas as pd

In [4]:
# Versões dos pacotes usados neste jupyter notebook
%reload_ext watermark
%watermark -a "John Costa" --iversions

Author: John Costa

pandas: 1.5.0

# Pandas - Dataframes, Métodos e Atributos

In [5]:
# Carrega um arquivo do disco e armazena como um dataframe
df = pd.read_csv('dados/dataset1.csv')

In [6]:
# Tipo do objeto
type(df)

pandas.core.frame.DataFrame

In [7]:
# Atributo shape
df.shape

(615, 6)

In [8]:
# Atributo size (total de registros considerando cada coluna)
df.size

3690

In [9]:
# Método head()
df.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

In [10]:
# Método tail()
df.tail(10)

    club last_name first_name position  base_salary  guaranteed_compensation
605  VAN   Rosales      Mauro        M      65004.0                 65004.00
606  VAN    Seiler       Cole        D      54075.0                 54075.00
607  VAN      Shea       Brek      M-D     625000.0                670000.00
608  VAN    Tchani       Tony        M     275000.0                308333.33
609  VAN   Techera   Cristian        M     352000.0                377000.00
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                184000.00

In [11]:
# Método info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [12]:
# Método describe()
df.describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [13]:
# método describe() para uma coluna
df.club.describe()

count     614
unique     23
top       VAN
freq       32
Name: club, dtype: object

In [14]:
# Método value_counts()
df.value_counts()

club  last_name  first_name  position  base_salary  guaranteed_compensation
ATL   Almiron    Miguel      M         1912500.0    2297000.0                  1
ORL   Perez      Matias      F         260004.0     260004.0                   1
      Redding    Tommy       D         110000.0     117500.0                   1
      Rivas      Carlos      M         375000.0     375000.0                   1
      Rocha      Tony        M         65620.8      65620.8                    1
                                                                              ..
KC    Iwasa      Cameron     F         53004.0      53004.0                    1
      Juliao     Igor        D         100008.0     115008.0                   1
      Medranda   Jimmy       D         130008.0     130008.0                   1
      Melia      Tim         GK        165000.0     167500.0                   1
VAN   de Jong    Marcel      D-M       140000.0     140000.0                   1
Length: 600, dtype: int64

In [15]:
# método value_counts() para cada tipo de dado
df.dtypes.value_counts()

object     4
float64    2
dtype: int64

In [16]:
# método value_counts() para uma coluna
df.club.value_counts()

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
HOU      28
NYRB     28
TOR      27
RSL      27
POR      27
MTL      27
CHI      27
MNUFC    27
LA       27
DC       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

In [17]:
# Extrai o s dados de uma coluna
df.club

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [18]:
# Extrai os dados de uma coluna
df['club']

0      ATL
1      ATL
2      ATL
3      ATL
4      ATL
      ...
610    VAN
611    VAN
612    VAN
613    NaN
614    VAN
Name: club, Length: 615, dtype: object

In [19]:
# Visualiza os dados extraídos de uma coluna
df['club'].head(10)

0    ATL
1    ATL
2    ATL
3    ATL
4    ATL
5    ATL
6    ATL
7    ATL
8    ATL
9    ATL
Name: club, dtype: object

In [20]:
# Retorna o tipo do dado
df['club'].dtypes

dtype('O')

In [21]:
# Tipo de dados em uma coluna
type(df['club'])

pandas.core.series.Series

In [22]:
# Podemos usar a função DataFrame() para criar dataframes pandas a partir de estruturas de dados Python
dados = [['a',1,1.0], ['b',2,2.0],['c',3,3.0]]
df_teste = pd.DataFrame(dados)

In [23]:
df_teste.head()

   0  1    2
0  a  1  1.0
1  b  2  2.0
2  c  3  3.0